app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "saves".* FROM "saves" WHERE "saves"."post_id" = ?  [["post_id", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "<p>efffffffffffffffffffcasczads</p>\r\n"], ["updated_at", "2020-05-25 18:58:41.278236"], ["id", 2]]
---

                    <% is_saved = @post.saves.find { |safe| safe.user_id == current_user.id} %>