app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params.merge(user_id: current_user.id))
        @post.user = current_user
        if @post.save
---
INSERT INTO "posts" ("title", "author", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "feef"], ["author", "fefefe"], ["summary", "efef"], ["body", "<p>efefef</p>\r\n"], ["created_at", "2020-05-25 17:45:08.544906"], ["updated_at", "2020-05-25 17:45:08.544906"]]

    def update
        if @post.update_attributes(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "<p>efffffffffffffffffffcasczads</p>\r\n"], ["updated_at", "2020-05-25 18:58:41.278236"], ["id", 2]]

    def user_saves
        @posts =  Post.select{ |s|  s.saves.find { |safe| safe.user_id == current_user.id}};
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
SELECT "saves".* FROM "saves" WHERE "saves"."post_id" = ?  [["post_id", 1]]