app/controllers/saves_controller.rb

INSERT INTO "saves" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["created_at", "2020-05-26 15:20:11.174349"], ["updated_at", "2020-05-26 15:20:11.174349"]]
---
    def create
        if already_saved?
          flash[:notice] = "Already saved :)"
        else
          @post.saves.create(user_id: current_user.id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find(params[:post_id])