app/controllers/tags_controller.rb

    def show
        @tag = Tag.find_by(name: params[:id])
        @tags =@tag.posts.order(created_at: 'DESC')
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "#kokoko"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ? ORDER BY "posts"."created_at" DESC  [["tag_id", 2]]